{
	"speech": [
		{
			"offset": [
				"0.0",
				"55.7"
			],
			"transcript": "안녕하십니까 이번 동영상에서는 컴퓨팅적사고 란 무엇인가라는 주제로 강의를 하도록 하겠습니다 먼저 컴퓨팅적 사고에 대한 여러 저희들을 살펴보고 공통점을 발견했어요도록 하겠습니다 그리고 그 공통점을 바탕으로 컴퓨팅적사고 4가지 요소인 문제 분할 패턴 식별 추상화 알고리즘에 대하여 그 뜻이 무엇인지 살펴보도록 하겠습니다 끝으로 여기 있는 평가는 알고리즘이 주어진 문제에 대하여 올바로 고환 되었는지를 판가름하는 방법입니다만 다섯 번째로 중요한 요소로 다루어지고 있어서 이번 시간에 간단히 언급을 하도록 하겠습니다"
		},
		{
			"offset": [
				"59.9",
				"119.9"
			],
			"transcript": "어떤 것을 처음 설명할 때 그것과 유사하다고 생각되어지는 것들과 차이점을 설명하면 설명이 편리할 때가 있습니다 지금도 마찬가지고 먼저 컴퓨팅적사고와 코딩 프로그램 인간은 어떻게 다른가입니다 여러분들도 전시관이 강의를 통해서 정리가 되었을 것으로 압니다만 컴퓨팅적 사고는 컴퓨터가 할 일을 정확하게 알려 주기 위해서 a 생각하는 것입니다 반면에 일하는 것은 컴퓨터에게 컴퓨터가 할 일과 방법을 알려 주는 것입니다 예를 들어 요리를 생각해 봅시다 갖고 있는 맛있는 음식 만드는 것은"
		},
		{
			"offset": [
				"119.9",
				"179.8"
			],
			"transcript": "컴퓨팅적사고에 해당하는 것입니다 그런데 그 레시피에 따라 요리사가 요리를 할 수 있겠지만 만약 로봇에 내장된 컴퓨터 간 요리를 하도록 하는 경우를 가정한다면 컴퓨터에게 그 요리 하는 과정 예를 들어 그릇을 가스레인지 올리시오 가스레인지에 불이 붙이시고 물이 끓을 때까지 기다리시오 컴퓨터가 할 일을 순서적으로 알려 주는 것은 코딩에 해당됩니다 어떤 것이 더 중요할까요 둘 다 중요하겠죠 하지만 코딩 보다는 타고가 먼저 겠죠 일을 잘 만들어야 좋은 음식이 나오지 않겠습니까 컴퓨팅적사고와 코딩에 차이는 그런 거지"
		},
		{
			"offset": [
				"179.9",
				"239.8"
			],
			"transcript": "자 그럼 컴퓨팅적 사고에 대해서 각종이 자료에서는 어떻게 정리를 내리고 있는지 한번 살펴봅시다 먼저 위키피디아입니다 인터넷 이용자들이 직접 참여해서 만든 온라인 백과사전입니다 여기 보니 카네기멜론대학교 약 자르는 cm 유적 컴퓨터 분야에서 세계적인 대학교입니다 이곳에 위라는 교수님이 처음 소개했다고 합니다 페이지가 오른쪽에 있는 것과 같습니다 참고로 ACM 컴퓨터 분양 세계 최고의 학술단체입니다 컴퓨팅적 사고는 다음과 같은 특징을 갖는 문자"
		},
		{
			"offset": [
				"239.8",
				"298.7"
			],
			"transcript": "과정이다라고 정의하고 있습니다 번째 두 번째 데이터를 모델링하고 추상화하여 시뮬레이션 하는 특징 컴퓨터가 실행 가능한 문제로 형식화 하는 특징 문제 해결 방식을 시험하여 구현하는 특징 알고리즘을 관하여 문제 해결을 자동화하는 특징 해결을 과정을 일반화하여 다른 문제에도 적용 안 갖고 있는 사고의 과정이다 또는 문제 해결의 과정이다라고 정리를 하고 있습니다 그런데요 여기는 문장들이 매우 어려울 겁니다 하지만 거 먹지 마시길 바랍니다 일단 중요한 단어만 체크하고 넘어 가도록 합시다"
		},
		{
			"offset": [
				"299.8",
				"359.4"
			],
			"transcript": "여기 나온 구조화 추상화 형식과 문제 해결 강식이 식별 자동화 이런 것들입니다 이따가이 중요한 몇 가지를 그 지진이란 교수님이 카네기멜론대 하게 컴퓨팅적사고 연구센터를 만들었습니다 컴퓨터 홈페이지를 이렇게 해서 배가 되고 있습니다 컴퓨팅적 사고는 문제를 형식과 하고 정보처리기기 의하여 효과적으로 수행 될 수 있는 솔루션을 찾는것과 관계된"
		},
		{
			"offset": [
				"359.8",
				"419.4"
			],
			"transcript": "사고 과정이다 그러니까 문제를 형식화 한다 정보처리 에이전트 컴퓨터를 광의적으로 편한 2 정보 처리 에이전트가 효과적으로 수행할 수 있는 솔루션을 찾는다 하는 것들 관계된 사라고 과정이라는 건 다 여기 오른편에 사람과 체스를 두는 컴퓨터가 나와 있는 그림 있습니다 사람이야 그렇다 칩시다 컴퓨터가 어떻게 사람과 컴퓨터에 그렇게 코딩 코딩 있기 때문이겠죠 바로이 팀을 위해 하는 문제를 형식과 하고 그것에 대한 솔루션을 만드는 사고과정이 있었다는 것이다 즉 형식 하와 솔루션이라는 것 두 개를"
		},
		{
			"offset": [
				"419.7",
				"479.3"
			],
			"transcript": "사고과정이 있어 다른 건 다 여기서 문제 형식 하라는 것은 체스라는 문제를 여호와 수식 같은 표현법을 본질을 해석하고 표현해내는 것 그런 것을 의미한다는 정도로 알고 넘어가면 좋겠습니다 그리고 여기서 솔로 알고리즘을 이야기한다고 보면 되겠습니다 교수님의 경희는 아직까지 그래도 왠지 그러면 우리나라 인터넷에 올라와 있는 점은 어떤지 한번 봅시다 개발에 적절한 사고방식을 말한다 문제 상황에 핵심원리를 찾아내 일을 재구성하고 순서도를 만들어 해결하는 방식이다"
		},
		{
			"offset": [
				"479.7",
				"537.4"
			],
			"transcript": "한 마리도 등장을 했습니다 데이터를 모으고 조작하기 문제를 작은 문제들로 쪼개기 문제를 구조화하고 추상화하기 순서에 따라 문제를 해결하는 것을 자동화하기 등이 포함됩니다이 과정에서 디지털 시대에 필요한 사고력과 문제해결능력 창의력 등을기를 수 있다 이렇게 나와 있습니다 여기서 중요한 자들이 몇 개 나옵니다 다시 말해서 무기 조작하기 쪼개기 구조화하기 추상화 자동화하기 그리고 순서에 따라 나는 말도 나온다"
		},
		{
			"offset": [
				"539.7",
				"599.3"
			],
			"transcript": "내용과 사실상 유사하지만 좀 더 친숙한 단어들로 표현된 것 같습니다 한 가지 더 볼까요 인터넷을 서핑 에보니 오른쪽 거 같은 그림 있더군요 자엽 일본이 디컴포지션 되어 있습니다 즉 혹은 문제 분할이라는 뜻입니다 또 그 밑에 일하고 있습니다 저는 돈 감옥에서 일을 했던 식별이라고 부르도록 하겠습니다 보다 광범위하게 패턴인식이라는 용어를 사용하고 있는데요 컴퓨팅적사고와 무관하지 않지만 혹시나 완전히 동일한 것으로 오해할 수도 있기 때문에 다른 용어"
		},
		{
			"offset": [
				"599.7",
				"659.3"
			],
			"transcript": "패턴 식별하는 영어를 사용하도록 하겠습니다 아무튼 패턴 시편이라 하면 데이터를 분석하고 그 안에서 질서를 찾는 거 알고 있죠 순서에 따라 자동화 하는 것을 이야기합니다 어떻습니까 하나만 더 보도록 하겠습니다 영국 이야기인데요 영국도 컴퓨팅적 사고에 대한 교육을만큼이나 국가적으로 본격적으로 추진하고 있습니다 BBC의 사이즈라는 곳을 가보니 컴퓨팅적 사고를 아래와 같이 다섯 개"
		},
		{
			"offset": [
				"659.6",
				"719.4"
			],
			"transcript": "서로 이루어지는 것으로 명확하게 정리를 했습니다 즙 문제 분할 복잡한 문제를 작고 다르게 이용해 한 부분으로 쪼개기라는 뜻입니다 식별 분할된 문제들 속에서 혹은 기존의 문제와의 유사성을 찾기라는 뜻입니다 추상화 중요한 정보에 포커스 하고 관계가 적은 디테일한 것은 무시하기라는 뜻입니다 알고리즘과 알고리즘 문제를 해결하기 위해 순차적으로 수행의 나가야 할 단계는 아구찜 규칙을 관하여"
		},
		{
			"offset": [
				"719.6",
				"778.9"
			],
			"transcript": "마지막으로 다섯 번째 평가 알고리즘이 주어진 문제를 제대로 해결하는 것인지를 판단하는 과정을 탑니다 다섯 개 중에서 세 개를 마치 책상 다리에 비교를 했습니다 이것을 색상이라고 보고 하나 하나를 책 보는 것입니다 하나라도 없으면 책상에 쓰러진 거 같이 올바로 함께 적용되어야 만 좋은 프로그램을 만들 수 있다라고 이야기하고 있습니다 아주 잘 정리된 내용입니다"
		},
		{
			"offset": [
				"779.6",
				"839.4"
			],
			"transcript": "따라서 지금부터 우유에 다섯 가지 항목 하나하나에 대해서 의미들을 틀어 나가 볼까 합니다 컴포지션 문제고 날입니다 문제 분할이란 복잡한 문제를 다룬 비용이 안 작은 문제로 쪼개는 것이라고 믿습니다 오른쪽에 문제 봄날의 간절한 얘가 나와 있습니다 바로 근의 공식 2조 우리가이 근의 공식을 어떻게 생각해 보면 쉽게 문제고 나를 이해할 수가 있습니다 우리는 당연히 수식 내항 하나하나를 대충 쪽으로 계산을 합천 아가 물었어 전체적인 계산을 이루어 나갑니다 컴퓨터에 개도 이렇게 개선하도록 하면 효과"
		},
		{
			"offset": [
				"839.5",
				"899.0"
			],
			"transcript": "방법이 될 것이란 겁니다 근의 공식을 보니 왠지 머리가 지끈지끈 하시나요 이것은 그냥 설명하기 컴퓨팅적 사고가 이런 근의 공식 계산을 하는 것을 주로 다루는 것은 아니니 걱정하지 마시기 바랍니다 그런데 문제 보다를 왜 할까요 문제를 하지 않고 여러 단계를 하나로 묶어 생각하게 되면 문제를 풀기가 훨씬 어렵기 때문입니다 문제를 분할 화면 분할 된 강 문제는 보다 쉽고 상세하게 풀어 낼 수가 있기 때문입니다 잘 생각해보세요 근의 공식을"
		},
		{
			"offset": [
				"899.5",
				"959.4"
			],
			"transcript": "한꺼번에 한눈에 단칼에 계산하는 그런 주인은 별로 없을 겁니다 복잡한 시스템이 어떻게 동작하는지를 이해하기 위하여 파트별로 혹은 부품별로 살펴보는 것과 유사하다 이렇게도 또 설명을 드릴 수가 다른 예를 갖고 생각해 봅시다 어느 곳에 사건이 발생하여 경찰관이 조사를 시작했다고 가정해봅시다 사건이 발생하는 것은 순식간이지만 그 사건을 조사 하는 것은 매우 복잡한 문제가 될 것입니다 그렇기 때문에 아래와 같이 작은 단위 문제로 분할해서 답을 찾고 그 답을 못"
		},
		{
			"offset": [
				"959.5",
				"1018.1"
			],
			"transcript": "전체적인 사건의 전모를 재구성하게 될 것입니다 예를 들어 어떤 사건이 발생한 것인가 언제 발생했는가 어디에서 사건 있는 것인가 아마 이러한 문제 분할이 잘 이루어져야만 사건 조사가 빈틈없이 체계적으로 이루어질 것입니다 컴퓨터에게 작업을 시킬때도 이와 같이 작은 단위의 작업으로 나누어 일을 시키면 일을 시키기도 좋아 컴퓨터를 효과적으로 활용할 수 있을 것입니다 그럼이 문제 분할을 우리가 실습을 하고 있는 스크래치와 연결을 시켜 본다면 어떻게 설명을 해 볼 수 있을까요"
		},
		{
			"offset": [
				"1019.4",
				"1079.2"
			],
			"transcript": "가장 먼저 떠오르는 것이 무대 전체를 대상으로 한 각본 전체를 스프라이트 별로 나누어 스크립트를 만들어 주는 것을 얻을 수 있습니다 그렇겠죠 무대 전체를 구성하고 있는 각 등장인물들 하나하나 아무래도 전체를 만들어 나가는데 쉽게 접근을 할 수가 있겠습니다 자 실습하고 있는 내용과 컴퓨팅적사고 관계성이 번뜩 떠오르는 것 같지 않습니까 아마 그런 순간들이 앞으로 돼 있을 겁니다 이런 것들 관련해서는 다음 주 동영상에서 좀 더 자세히 다루어보도록 할 것입니다 다음은 패턴"
		},
		{
			"offset": [
				"1079.4",
				"1137.7"
			],
			"transcript": "간단한 급한 거 같지 패턴 별이랑 분할된 문제들과네 유사성 혹은 기존 문제와의 유사성을 찾는 것을 한마디로 문제 속에서 패턴을 찾아낸다는 것인데요 그것이 왜 필요할까요 터널 발견하게 되면 복잡한 문제를 보다 효과적으로 공략 할 수 있기 때문입니다 우리는 이미 고등학교 수학에서 수요를 배웠는데요 수요일도 패턴의 일종입니다 예를 들어 여기에 있는 숫자들은 유사성 아니 공통점이 있습니다 바로 전 숫자의 3월 더 했다는 공통점이죠 숫자 속에서 식별되는 패턴이라 볼 수 있겠습니다"
		},
		{
			"offset": [
				"1139.4",
				"1198.8"
			],
			"transcript": "플라이 데는 없지만 실생활이 한 예로 사상체질을 하는 것을 예로 들 수 있겠습니다 한 사람이 소양인이라고 한다면 그것은 그 사람에게서 소양인으로서의 패턴이 발견되었기 때문입니다 그렇게 그 사람이 소양인이라고 별이 되고 나면 그 다음 문재인 그 사람에 대한 진료 라든지 처방 이라든지 공략하기 훨씬 더 쉬워질 것입니다 별은 뭔가를 만들어내는 작업 애들 매우 유용합니다 컴퓨팅적사고 해서든 주로 컴퓨터로 하여금 작업을 하도록 하는 것이 주목적이기 때문에 어떤 작업을 하는 과정에서이 패턴과 패턴 식별이"
		},
		{
			"offset": [
				"1199.4",
				"1256.9"
			],
			"transcript": "어떻게 적용되는지를 생각해보면 배우 좋을 것입니다 자 어떤 큰 작업을함에 있어서 문제 분할이 이미 이루어졌고 둘 중에 주문에 따라 고양이를 그리는 작업이 있었다고 생각해 봅시다 예를 들어 고양이 애인은 녹색 눈의 꼬리에 검은 색깔 고양이 피는 노란 눈의 짧은 꼬리에 불 모니터를 갖고 있는 등등 다양한 고양이 그리는 주문이 들어오고 있다고 합니다 하지만 여기서 주문이 들어와서 작업해야 할 모든 고양이는 공통적인 특징을 갖고 있습니다 즉 우리와 눈과 있다는 것입니다"
		},
		{
			"offset": [
				"1259.3",
				"1318.8"
			],
			"transcript": "고양이를 그리는 작업을 만나든간에 눈과 꼬리와 철은 반드시 드려야 합니다 체육 눈 꼬리 컬러 이루어지는 고양이라는 패턴 패턴을 여기서 발견할 수 있는 거지 고요 고양이 a 왔고요 무엇일까요 여기서 개체 영어로 인스턴스로 합니다 바로 술 안 패턴 패턴의 실체를 의미합니다 이렇게 고양이 패턴이 만들어지게 되면 컴퓨터는 보다 효과적으로 고양이 그리는 작업을 할 수 있을 것입니다 예를 들어"
		},
		{
			"offset": [
				"1319.3",
				"1367.2"
			],
			"transcript": "색깔 같은 의미를 갖는 긴꼬리 고양이들을 그리는 작업을 하게 되었다고 봅시다 긴꼬리 고양이의 모양을 패턴으로 볼 수가 있습니다 이런 패턴은 우리 일상생활에서 본다면 마치 스탬프 같은 것이겠죠 주문이 들어오면 캠프를 찍은 후 눈이 색깔과 털이 색깔 부근 무늬를 색연필을 이용하여 하면 됩니다 하나를 완성하는 거"
		},
		{
			"offset": [
				"1379.3",
				"1437.5"
			],
			"transcript": "작업 속도가 느릴뿐만 아니라 일관성을 이룰 수도 있을 것입니다 그런데요 많이 갖고 있다면 그럼 다양한 스탬프를 많이 갖고 있을수록 다양한 주문을 쉽고 빠르게 해결할 수 있을 것입니다이 이야기는 결국 만약 우리가 문제를 해결하는 패턴을 많이 알고 있다면 새로운 문제가 그것을 활용하여 훨씬 더 효과적으로 문제를 풀어 낼 수 있다는 것인데요 교리란 이러한 원리를 컴퓨터 집적 사고에 활용하자는 것입니다 다음은 초상화입니다 초상화는 영어로 앱 스트럭션입니다"
		},
		{
			"offset": [
				"1439.2",
				"1498.1"
			],
			"transcript": "성화란 한 마디로 패턴 식별이 과정에서 중요한 패턴의 만 포커스를 하고 관계가 적은 패턴이나 뒤란 데이터는 아웃 하는 것입니다 컴퓨터로 하여금 풀기 할 문제 혹은 작업을 본질을 찾아내는 사고의 과정이라 하겠습니다 추상화 과정을 거치게 되면 주어진 문제의 본질은 이대하 혹은 우리는 이것을 한 편으로는 사실 좀 어려운 개념인데요 복잡한 문제 혹은 작업을 전화를 하고"
		},
		{
			"offset": [
				"1499.2",
				"1559.0"
			],
			"transcript": "그들간의 패턴을 식별 하다 보면 진정으로 컴퓨터가 해야 할 작업이 무엇인지에 대해서 그 본질적인 것을 잃어버릴 수가 있습니다 컴퓨팅적 사고를 하는 주체가 개념을 잘 활용함으로써 작업을 단순화시키고 꼭 필요한 작업을 하기 위한 사고에 집중하는 것이 보다 중요하다는 그런 뜻입니다 초상화의 간단한 예를 하나 들어보겠습니다 다시 고양이 그리기 예인데요 만약 고양이 그리기이라는 주문 녹색눈의 긴꼬리 검은색 차를 갖고 있고 고등어를 좋아하고"
		},
		{
			"offset": [
				"1559.2",
				"1618.7"
			],
			"transcript": "칼칼한 울음 소리를내는 고양이를 그려주세요 노란 눈에 짧은 꼬리 줄 모니터를 갖고 있고 꽁치를 좋아하고 낮은 울음 소리를내는 고양이를 그려주세요 나는 다양한 주문들이 들어오고 있다고 가정해 봅시다 사실 주문들이 이렇게 다양하게 들어왔지 문제를 이야기 하겠죠 과정에서 다 이루어진다 있습니다 고양이 패턴은 눈과 꼬리와 털로 구성된다 좋아하는 생선 울음소리 같은 그리기 문제와 상관없는 주문은 필터링 아웃 되었습니다뿐만 아니라"
		},
		{
			"offset": [
				"1619.1",
				"1676.8"
			],
			"transcript": "깔 꾸리 모양 색깔 등 것은 패턴에서 무시되고 단지 고양이의 눈과 꼬리와 털만 패턴의 요소로 본 것입니다 색깔이나 모양 등은 개체를 그려내는데 적용할 디테일한 사항이라는 것들이죠 이렇게 고양이를 주잖아 했다는 것은 다시 말해 고양이 그리기 작업이 본질을 알게 되었다는 것인데요 우리는 이것을 모델이라고도 합니다 과정은 바로 노래를 찾는 과정이라고도 이야기할 수 있겠습니다 이렇게 되면 우리가 필요로 하는 작업을 정확히 알게 되고이를 알고리즘으로 만들어 코딩을 할 수 있게 된다는 것입니다"
		},
		{
			"offset": [
				"1679.1",
				"1739.0"
			],
			"transcript": "다음은 컴퓨팅적사고 이대 번째 요소인 알고리즘 혹은 알고리즘 문화입니다 알고리즘이란 한마디로 문제를 해결하기 위하여 순차적으로 실행해 나가야 할 명령에 집합을 이야기합니다 여기서 한 마리 매우 중요합니다 우리 생활속에서 알고 있습니다 적으로 진행되는 것은 복잡하게 한 칸에 일정에 알고리즘으로 볼 수 있습니다 신발 끈 묶는 순서 커피 타는 순서입니다 알고리즘은 명령에 집합이기 때문에"
		},
		{
			"offset": [
				"1739.1",
				"1797.2"
			],
			"transcript": "명령어를 표현하는 코디의 출발점이 됩니다 의사 코드로 안 다른 말로 진짜 프로그램에 가깝지만 사람에게 친숙한 퇴원을 자르는 코드 다시 말해서 컴퓨터가 알아듣는 코드는 아니지만 컴퓨터가 알아듣는 코드에 가까우면서도 사람에게 북한 하는 그런 코드라는 뜻입니다 여기 플로우차트 외과 의사 코드 예가 보여지고 있습니다 사실 컴퓨터가 문제를 제대로 푸는 야 나는 작업을 제대로 하늘이 하는 것은"
		},
		{
			"offset": [
				"1799.1",
				"1857.7"
			],
			"transcript": "알고리즘에 정확성에 좌우된다고 해도 과언이 아닙니다 컴퓨터는 장애 작업은 할 수 없지 플로우차트가 무엇인지 잠깐 이야기하고 넘어가도록 하겠습니다 유행되어 줘야 할 명령에 집합을 비디오를 사용하여 순차적으로 표현한 다이어그램이다 이렇게 설정된 여기서 표준화된 기호라는 것이 중요합니다 이렇게 표준화된 기호를 사용하여 알고리즘 불편 하게 되면 어느 누가 보아도 그 뜻을 이해 할 것입니다 그렇게 하여야만 컴퓨팅적사고이 과정을 거쳐 알고리즘을 만들어내는 사람과"
		},
		{
			"offset": [
				"1859.0",
				"1917.8"
			],
			"transcript": "잘하는 사람이 분리될 수 있고 어느 누구와도 서로 협업이 이루어질 수 있을 것입니다 여기에 표준화된 기호 좀 2시가 되어 있습니다 아쉽지만 플로우차트를 사용하여 알고리즘을 표현하는 얘는 다음 시간에 보도록 하겠습니다 자 마지막으로 평가입니다 평가 evaluation 일하는 것은 솔루션 알고리즘이 주어진 일을 제대로 해결하는 것인지를 판별하는 과정입니다 평가가 없으면 알고리즘 오류가 문제 중 고려하지 않은 사람이 있음을 코딩 전 단계에서 알아낼 수 없기 때문에이 과정이 없다면"
		},
		{
			"offset": [
				"1919.0",
				"1978.7"
			],
			"transcript": "치명적인 오류 이어질 수도 있습니다 때문에 코드의 무결성을 입증하는 방법에 대하여 소프트웨어공학 끊임없이 연구를 하고 있는 학문분야에 기도합니다 여기서는 한 가지 가장 기초적인 방법만 예시로 보내 드리도록 하겠습니다 이런 방법인데요 방법은 종이를 사용하는 방법으로 다양한 조건이나 입력에 대하여 알고리즘 따라가면서 흐름과 답이 옳고 그름을 분석하는 그런 방법입니다 하지만이 방법은 알고리즘이 복잡해 지거나 규모가 커지면 사용하기 어려울 겁니다 아무튼 이렇게 답이 옳고"
		},
		{
			"offset": [
				"1979.0",
				"2038.9"
			],
			"transcript": "평가하는 것이 평가 2단계는 아닙니다 다양한 측면을 고려할 수도 있을 겁니다 예를 들어 성능은 충분한지 자원을 경제적으로 사용하고 있는지 사용하기에는 얼마나 편리한지 사용해 보고 싶은 것인지 등 등 다양한 것을 검토하고 평가할 수 있을 것입니다 과정을 통해서 제대로 된 알고 가게 되는 것입니다 오늘은 여기까지입니다 오늘은 코딩이란 컴퓨터에게 컴퓨터가 할 일과 방법을 알려 주는 것이고 컴퓨팅적 사고는 컴퓨터가 할 일을 정확하게 알려 주기 위한 생각을 하는 것이다"
		},
		{
			"offset": [
				"2038.9",
				"2096.1"
			],
			"transcript": "이야기 드렸습니다 컴퓨팅적사고를 구성하는네 가지 주요 요소에는 문제 분할 * 추상화 한 가지 더 보태서 평가가 있다 이렇게 설명드렸습니다 그리고 각각의 대해서 간단한 아마 그것이 무엇인지 설명을 하였습니다 비교적 개념적이고 뭐 하니 이야기들을 많이 했는데요 끝까지 듣느라 참 수고 많이 하셨습니다 다음 시간에는 이러한 마음을 조금이나마 컴퓨팅적사고 사례들을 알아보도록 하겠습니다 그러면 다음 동영상에서 안 하도록 하겠습니다"
		}
	],
	"inverted_idx": {
		"언제": [
			"968.3"
		],
		"중요": [
			"49.5",
			"161.6",
			"164.0",
			"295.1",
			"321.0",
			"515.6",
			"694.7",
			"1444.5",
			"1532.0",
			"1704.6",
			"1839.0"
		],
		"이": [
			"588.2",
			"605.8",
			"997.2",
			"1153.1",
			"1164.1",
			"1173.3",
			"1546.3",
			"1670.4"
		],
		"필요": [
			"506.6",
			"1098.0",
			"1526.7",
			"1668.0"
		],
		"시간": [
			"53.3",
			"1879.4",
			"2084.3"
		],
		"무시": [
			"702.8",
			"1626.2"
		],
		"등장인물": [
			"1041.7"
		],
		"위의": [
			"999.1"
		],
		"의사": [
			"1744.4",
			"1783.9"
		],
		"결국": [
			"1405.5"
		],
		"포커스": [
			"698.9",
			"1446.4"
		],
		"언급": [
			"54.3"
		],
		"접근": [
			"1052.8"
		],
		"사건의": [
			"960.2"
		],
		"등": [
			"510.5",
			"1623.3",
			"1636.2",
			"2003.9",
			"2005.5"
		],
		"집중": [
			"1529.5"
		],
		"풀기": [
			"881.0",
			"1457.5"
		],
		"요소": [
			"25.9",
			"50.1",
			"1631.9",
			"1683.6",
			"2047.0"
		],
		"체육": [
			"1267.2"
		],
		"스프라이트": [
			"1027.4"
		],
		"연구센터": [
			"334.3"
		],
		"표현": [
			"434.2",
			"546.4",
			"1740.9",
			"1830.8",
			"1877.2"
		],
		"문화": [
			"1685.9"
		],
		"이기": [
			"1193.4",
			"1738.3"
		],
		"해당": [
			"123.0",
			"159.2"
		],
		"분리": [
			"1860.2"
		],
		"번": [
			"48.8",
			"190.3",
			"242.5",
			"252.3",
			"463.1",
			"723.9",
			"1683.2"
		],
		"성화": [
			"1439.2"
		],
		"합천": [
			"830.0"
		],
		"뭔가": [
			"1182.1"
		],
		"경우": [
			"136.3"
		],
		"조사": [
			"936.0",
			"944.1",
			"989.6"
		],
		"부근": [
			"1354.7"
		],
		"전모": [
			"960.6"
		],
		"책상": [
			"745.0",
			"763.8"
		],
		"차이점": [
			"65.7"
		],
		"가지": [
			"25.2",
			"321.9",
			"549.5",
			"782.3",
			"1938.3",
			"2046.4",
			"2055.7"
		],
		"광범위": [
			"586.4"
		],
		"일반": [
			"272.8"
		],
		"직접": [
			"197.5"
		],
		"북한": [
			"1774.8"
		],
		"문제해결능력": [
			"507.9"
		],
		"참여": [
			"198.0"
		],
		"다음": [
			"237.6",
			"1069.8",
			"1074.9",
			"1166.9",
			"1428.8",
			"1679.1",
			"1878.2",
			"2082.4",
			"2093.1"
		],
		"편": [
			"1485.3"
		],
		"오늘": [
			"2016.9",
			"2022.2"
		],
		"시편": [
			"605.5"
		],
		"가게": [
			"2014.9"
		],
		"용어": [
			"588.5",
			"598.9"
		],
		"다리": [
			"746.4"
		],
		"사이즈": [
			"653.4"
		],
		"체계": [
			"990.7"
		],
		"공략": [
			"1106.3",
			"1173.7"
		],
		"이대": [
			"1682.9"
		],
		"상황": [
			"472.7"
		],
		"페이지": [
			"219.5"
		],
		"색상": [
			"750.5"
		],
		"처방": [
			"1171.2"
		],
		"하늘": [
			"1796.2"
		],
		"건": [
			"382.1",
			"421.6"
		],
		"사항": [
			"1641.2"
		],
		"이지만": [
			"942.3"
		],
		"해결의": [
			"284.2"
		],
		"신발": [
			"1719.3"
		],
		"위키피디아": [
			"193.1"
		],
		"진료": [
			"1169.7"
		],
		"마음": [
			"2085.2"
		],
		"각본": [
			"1025.5"
		],
		"사고의": [
			"278.7",
			"1461.5"
		],
		"코드": [
			"1750.1",
			"1761.3",
			"1767.4",
			"1770.6",
			"1777.6",
			"1785.9"
		],
		"시대": [
			"506.3"
		],
		"리기": [
			"1542.3",
			"1545.9",
			"1611.3",
			"1647.5"
		],
		"판별": [
			"1896.9"
		],
		"마찬가지": [
			"71.3"
		],
		"나": [
			"534.7",
			"819.0",
			"1573.1",
			"1792.8"
		],
		"내장": [
			"131.7"
		],
		"무기": [
			"518.3"
		],
		"사람": [
			"385.2",
			"390.9",
			"394.9",
			"1150.8",
			"1156.6",
			"1162.7",
			"1168.9",
			"1757.8",
			"1772.9",
			"1857.2",
			"1859.8",
			"1908.6"
		],
		"털": [
			"1352.4",
			"1602.5",
			"1630.3"
		],
		"단칼": [
			"902.5"
		],
		"사건": [
			"932.7",
			"937.6",
			"943.6",
			"967.0",
			"972.5",
			"988.1"
		],
		"에이전트": [
			"367.4",
			"373.9"
		],
		"교수": [
			"214.1",
			"330.3"
		],
		"스크립트": [
			"1030.7"
		],
		"정의": [
			"241.5"
		],
		"이용해": [
			"674.5"
		],
		"개체": [
			"1290.4",
			"1636.9"
		],
		"추상": [
			"254.0",
			"492.9"
		],
		"전": [
			"1127.6",
			"1912.6"
		],
		"우리나라": [
			"460.4"
		],
		"체크": [
			"297.0"
		],
		"불편": [
			"1843.7"
		],
		"판가름": [
			"45.1"
		],
		"타고": [
			"167.0"
		],
		"자료": [
			"187.8"
		],
		"고려": [
			"1906.5",
			"1986.2"
		],
		"플라이": [
			"1139.4"
		],
		"패턴인식": [
			"587.3"
		],
		"화면": [
			"887.0"
		],
		"관계": [
			"358.8",
			"379.8",
			"700.4",
			"1059.0",
			"1447.2"
		],
		"터널": [
			"1098.6"
		],
		"색깔": [
			"1225.1",
			"1319.3",
			"1351.9",
			"1354.3",
			"1622.1",
			"1633.0"
		],
		"마리": [
			"482.1",
			"1703.4"
		],
		"트럭션": [
			"1436.7"
		],
		"부분": [
			"675.0"
		],
		"분야": [
			"209.1"
		],
		"진정": [
			"1502.2"
		],
		"룰": [
			"1382.7"
		],
		"창의력": [
			"509.3"
		],
		"모델링": [
			"253.2"
		],
		"전시관": [
			"81.5"
		],
		"코드의": [
			"1924.5"
		],
		"이용": [
			"1359.0"
		],
		"집합": [
			"1698.1",
			"1737.9",
			"1825.5"
		],
		"수식": [
			"429.4",
			"822.7"
		],
		"수고": [
			"2081.6"
		],
		"이해": [
			"819.4",
			"914.6",
			"1847.7"
		],
		"모양": [
			"1334.3",
			"1621.6",
			"1636.1"
		],
		"개념": [
			"1491.8",
			"1514.9",
			"2074.2"
		],
		"후": [
			"1349.9"
		],
		"봄날의": [
			"806.9"
		],
		"밑": [
			"568.8"
		],
		"부품": [
			"917.7"
		],
		"한마디": [
			"1091.4",
			"1690.3"
		],
		"자엽": [
			"554.9"
		],
		"이곳": [
			"210.8"
		],
		"패턴": [
			"27.8",
			"599.7",
			"604.6",
			"1078.8",
			"1082.6",
			"1094.9",
			"1135.6",
			"1158.5",
			"1196.6",
			"1197.3",
			"1274.8",
			"1275.3",
			"1296.1",
			"1297.9",
			"1308.2",
			"1335.1",
			"1340.4",
			"1410.5",
			"1441.5",
			"1448.8",
			"1500.8",
			"1599.7",
			"1625.6"
		],
		"물": [
			"150.5"
		],
		"긴꼬리": [
			"1323.9",
			"1327.8",
			"1554.9"
		],
		"돈": [
			"576.9"
		],
		"자동": [
			"269.5",
			"500.1",
			"527.7"
		],
		"장애": [
			"1805.7"
		],
		"걱정": [
			"861.6"
		],
		"어디": [
			"970.7"
		],
		"아래": [
			"657.4",
			"951.3"
		],
		"출발점": [
			"1742.7"
		],
		"끈": [
			"1723.5"
		],
		"문제와의": [
			"688.6",
			"1088.8"
		],
		"아가": [
			"830.8"
		],
		"하와": [
			"415.1"
		],
		"그것": [
			"61.7",
			"406.8",
			"1096.4",
			"1154.7",
			"1414.9",
			"2068.7"
		],
		"머리": [
			"844.7"
		],
		"울음": [
			"1560.0",
			"1570.9"
		],
		"의미": [
			"437.9",
			"784.5",
			"1302.8",
			"1322.9"
		],
		"소개": [
			"218.7"
		],
		"한눈": [
			"900.4"
		],
		"별": [
			"1083.3",
			"1164.5",
			"1178.9"
		],
		"요리": [
			"108.7",
			"128.2",
			"133.0",
			"139.7"
		],
		"조건": [
			"1954.3"
		],
		"알고리즘": [
			"29.9",
			"39.8",
			"266.2",
			"443.6",
			"704.2",
			"707.4",
			"726.1",
			"1671.8",
			"1684.0",
			"1685.3",
			"1686.5",
			"1717.9",
			"1731.9",
			"1799.1",
			"1843.0",
			"1855.1",
			"1876.3",
			"1892.2",
			"1901.8",
			"1955.7",
			"1969.1"
		],
		"본격": [
			"649.8"
		],
		"디지털": [
			"505.4"
		],
		"경희": [
			"453.8"
		],
		"동영상": [
			"3.3",
			"1070.8",
			"2094.0"
		],
		"조": [
			"811.6"
		],
		"답": [
			"956.7",
			"958.8",
			"1962.2",
			"1977.4"
		],
		"원리": [
			"1425.1"
		],
		"여기": [
			"37.7",
			"200.7",
			"288.8",
			"299.8",
			"382.5",
			"422.0",
			"442.4",
			"513.9",
			"1118.6",
			"1243.0",
			"1278.6",
			"1286.0",
			"1700.3",
			"1778.5",
			"1835.0",
			"1866.2",
			"1935.4",
			"2021.5"
		],
		"책": [
			"754.4"
		],
		"거지": [
			"179.6",
			"1280.2"
		],
		"문재인": [
			"1167.1"
		],
		"본질": [
			"431.7",
			"1460.3",
			"1471.8",
			"1507.5",
			"1648.3"
		],
		"시뮬레이션": [
			"254.9"
		],
		"에보니": [
			"552.8"
		],
		"컴포지션": [
			"787.5"
		],
		"조금": [
			"2085.8"
		],
		"식별": [
			"28.5",
			"308.6",
			"580.3",
			"600.2",
			"678.1",
			"1134.9",
			"1198.4",
			"1443.4",
			"1501.3"
		],
		"적용": [
			"275.1",
			"770.7",
			"1200.3",
			"1639.0"
		],
		"순간": [
			"1064.7"
		],
		"월": [
			"1128.5"
		],
		"정보처리기기": [
			"353.1"
		],
		"불": [
			"149.7",
			"1231.3"
		],
		"개도": [
			"835.9"
		],
		"효과": [
			"355.5",
			"374.6",
			"838.3",
			"1004.7",
			"1105.7",
			"1312.1",
			"1418.4"
		],
		"주체": [
			"1514.1"
		],
		"주목적": [
			"1192.8"
		],
		"노래": [
			"1656.0"
		],
		"솔루션": [
			"357.5",
			"376.3",
			"408.6",
			"415.6",
			"1890.1"
		],
		"방법": [
			"46.5",
			"104.3",
			"839.5",
			"1928.0",
			"1940.2",
			"1945.3",
			"1946.2",
			"1952.5",
			"1965.8",
			"1968.6",
			"2027.8"
		],
		"문제": [
			"26.4",
			"42.3",
			"258.9",
			"260.9",
			"268.7",
			"274.6",
			"283.8",
			"305.2",
			"350.0",
			"363.8",
			"405.2",
			"423.5",
			"427.7",
			"470.9",
			"486.4",
			"488.9",
			"490.0",
			"496.6",
			"564.6",
			"666.5",
			"673.0",
			"685.7",
			"709.6",
			"731.4",
			"792.8",
			"794.5",
			"798.6",
			"800.6",
			"806.1",
			"818.1",
			"866.1",
			"869.3",
			"879.5",
			"883.6",
			"889.3",
			"947.4",
			"955.6",
			"984.6",
			"1009.1",
			"1085.3",
			"1094.1",
			"1104.5",
			"1207.9",
			"1409.0",
			"1414.4",
			"1419.0",
			"1458.2",
			"1494.5",
			"1583.1",
			"1612.2",
			"1691.4",
			"1791.5",
			"1904.0",
			"2047.6"
		],
		"세계": [
			"209.6",
			"229.5"
		],
		"둘": [
			"162.3",
			"1210.6"
		],
		"고등학교": [
			"1111.0"
		],
		"흐름": [
			"1960.1"
		],
		"가능": [
			"258.5"
		],
		"소리": [
			"1560.3",
			"1571.1"
		],
		"우유": [
			"781.3"
		],
		"항목": [
			"782.5"
		],
		"주": [
			"1070.5"
		],
		"실습": [
			"1011.4",
			"1056.3"
		],
		"일상생활": [
			"1341.3"
		],
		"치명": [
			"1919.0"
		],
		"인스턴스": [
			"1292.4"
		],
		"입증": [
			"1926.7"
		],
		"온라인": [
			"199.2"
		],
		"필터링": [
			"1613.8"
		],
		"평가": [
			"39.2",
			"724.3",
			"1884.5",
			"1885.4",
			"1898.8",
			"1979.0",
			"1980.6",
			"2008.2",
			"2056.5"
		],
		"설명": [
			"61.1",
			"67.4",
			"67.9",
			"850.8",
			"922.0",
			"1016.4",
			"2060.6",
			"2070.3"
		],
		"교육": [
			"646.8"
		],
		"입력": [
			"1954.9"
		],
		"등등": [
			"1234.2"
		],
		"실생활": [
			"1140.9"
		],
		"발견": [
			"19.0",
			"1102.0",
			"1159.4",
			"1279.5"
		],
		"스크래치": [
			"1012.5"
		],
		"서의": [
			"1158.1"
		],
		"등장": [
			"482.5"
		],
		"오른편": [
			"384.6"
		],
		"정도": [
			"438.6"
		],
		"거": [
			"292.9",
			"553.6",
			"611.6",
			"765.4",
			"1082.0",
			"1367.0"
		],
		"해결": [
			"262.9",
			"269.1",
			"270.7",
			"307.4",
			"478.0",
			"497.8",
			"711.9",
			"732.5",
			"1400.1",
			"1410.0",
			"1691.9",
			"1895.6"
		],
		"기도": [
			"1934.8"
		],
		"예시": [
			"1940.8"
		],
		"바탕": [
			"22.7"
		],
		"공식": [
			"811.2",
			"814.3",
			"843.5",
			"857.6",
			"898.4"
		],
		"소프트웨어공학": [
			"1928.8"
		],
		"지금": [
			"70.2",
			"780.6"
		],
		"문자": [
			"239.2"
		],
		"정보": [
			"373.0",
			"698.4"
		],
		"울음소리": [
			"1609.4"
		],
		"감옥": [
			"577.2"
		],
		"이것": [
			"747.7",
			"846.6",
			"1484.8",
			"1651.4"
		],
		"배": [
			"346.6"
		],
		"로봇": [
			"130.6"
		],
		"애인": [
			"1220.9"
		],
		"속도": [
			"1379.9"
		],
		"프로그램": [
			"76.0",
			"772.6",
			"1756.5"
		],
		"형식": [
			"303.4",
			"352.2",
			"405.7",
			"413.8",
			"424.5"
		],
		"처음": [
			"60.7",
			"215.0"
		],
		"추진": [
			"650.4"
		],
		"생각": [
			"64.2",
			"94.2",
			"110.1",
			"815.4",
			"878.6",
			"896.5",
			"928.4",
			"1201.2",
			"1217.0",
			"2037.0"
		],
		"단순": [
			"1524.6"
		],
		"파트": [
			"915.4"
		],
		"경찰관": [
			"934.0"
		],
		"카네기멜론대학교": [
			"203.3"
		],
		"국가": [
			"648.9"
		],
		"개선": [
			"837.1"
		],
		"유사성": [
			"1086.2",
			"1121.0"
		],
		"과언": [
			"1802.4"
		],
		"사례": [
			"2089.3"
		],
		"얘": [
			"808.4",
			"1877.8"
		],
		"생활속": [
			"1706.6"
		],
		"그간의": [
			"1499.2"
		],
		"관련": [
			"1068.8"
		],
		"겁니다": [
			"291.2",
			"841.0",
			"909.0",
			"1066.3",
			"1973.9",
			"1988.0"
		],
		"단어": [
			"296.2",
			"545.9"
		],
		"자원": [
			"1991.4"
		],
		"집적": [
			"1426.2"
		],
		"강": [
			"889.0"
		],
		"경제": [
			"1994.9"
		],
		"순식간": [
			"941.6"
		],
		"수요일": [
			"1113.6"
		],
		"형식화": [
			"259.4",
			"364.5"
		],
		"코디의": [
			"1741.6"
		],
		"주제": [
			"7.6"
		],
		"여러분": [
			"79.7"
		],
		"무늬": [
			"1356.5"
		],
		"각종": [
			"186.9"
		],
		"처리": [
			"373.6"
		],
		"진행": [
			"1713.1"
		],
		"피": [
			"1227.2"
		],
		"애": [
			"1184.8"
		],
		"협업": [
			"1864.1"
		],
		"주인": [
			"907.1"
		],
		"가스레인지": [
			"146.2",
			"147.8"
		],
		"음식": [
			"115.5",
			"173.2"
		],
		"디테일": [
			"701.9",
			"1640.4"
		],
		"내항": [
			"824.0"
		],
		"숫자": [
			"1120.4",
			"1130.9"
		],
		"데이터": [
			"252.7",
			"483.1",
			"606.4",
			"1450.2"
		],
		"디컴포지션": [
			"557.1"
		],
		"색": [
			"1555.5"
		],
		"속": [
			"686.3",
			"1094.5",
			"1134.5"
		],
		"포함": [
			"502.6"
		],
		"아구찜": [
			"716.7"
		],
		"주기": [
			"92.7",
			"2036.4"
		],
		"약": [
			"205.3"
		],
		"정보처리": [
			"365.5"
		],
		"유사": [
			"63.4",
			"542.7",
			"689.3",
			"919.6",
			"1089.5"
		],
		"끝": [
			"35.1",
			"2078.6"
		],
		"완성": [
			"1366.4"
		],
		"광의": [
			"370.0"
		],
		"주문": [
			"1212.4",
			"1238.6",
			"1243.9",
			"1345.3",
			"1398.1",
			"1546.8",
			"1575.0",
			"1580.4",
			"1613.3"
		],
		"뜻": [
			"33.1",
			"566.7",
			"677.9",
			"691.7",
			"704.0",
			"1533.6",
			"1778.2",
			"1847.2"
		],
		"판단": [
			"733.9"
		],
		"생선": [
			"1608.9"
		],
		"단위": [
			"955.0"
		],
		"대하": [
			"1472.4"
		],
		"종이": [
			"1949.5"
		],
		"특징": [
			"238.6",
			"255.9",
			"260.4",
			"265.7",
			"270.3",
			"1248.8"
		],
		"참": [
			"2081.1"
		],
		"해석": [
			"433.6"
		],
		"레시피": [
			"126.0"
		],
		"일본": [
			"556.7"
		],
		"규칙": [
			"717.4"
		],
		"규모": [
			"1970.8"
		],
		"구성": [
			"475.0",
			"961.1",
			"1039.3",
			"1603.6",
			"2045.3"
		],
		"곳": [
			"654.8",
			"932.4"
		],
		"뿐": [
			"1380.5",
			"1615.8"
		],
		"쪽": [
			"829.1"
		],
		"반면": [
			"95.3"
		],
		"컴퓨터": [
			"88.9",
			"99.3",
			"101.7",
			"132.3",
			"137.5",
			"153.1",
			"207.6",
			"227.8",
			"256.4",
			"336.5",
			"368.0",
			"388.4",
			"393.6",
			"395.7",
			"834.2",
			"992.9",
			"1003.6",
			"1190.1",
			"1309.8",
			"1425.7",
			"1454.1",
			"1503.8",
			"1764.8",
			"1769.0",
			"1790.9",
			"1803.5",
			"2025.3",
			"2026.6",
			"2033.6"
		],
		"이용자": [
			"196.6"
		],
		"플로우차트": [
			"1782.5",
			"1810.8",
			"1875.1"
		],
		"꼬리": [
			"1223.3",
			"1230.9",
			"1264.6",
			"1270.2",
			"1566.8",
			"1601.9",
			"1629.8"
		],
		"자": [
			"179.9",
			"516.2",
			"1054.9",
			"1204.1",
			"1880.8"
		],
		"수": [
			"128.9",
			"357.1",
			"375.8",
			"511.3",
			"773.7",
			"1006.1",
			"1017.5",
			"1033.8",
			"1106.9",
			"1137.1",
			"1147.8",
			"1279.9",
			"1315.9",
			"1400.8",
			"1420.2",
			"1659.3",
			"1675.2",
			"1719.0",
			"1810.1",
			"1860.9",
			"1865.3",
			"1913.9",
			"2008.9"
		],
		"기존": [
			"1088.1"
		],
		"상": [
			"541.8"
		],
		"명령어": [
			"1739.1"
		],
		"개": [
			"419.0",
			"516.9",
			"659.1",
			"740.6",
			"743.8"
		],
		"전체": [
			"831.5",
			"959.5",
			"1023.9",
			"1026.9",
			"1038.7",
			"1048.8"
		],
		"일과": [
			"103.8",
			"2027.4"
		],
		"것": [
			"60.4",
			"65.1",
			"85.5",
			"94.9",
			"98.9",
			"106.1",
			"119.0",
			"123.5",
			"158.0",
			"161.3",
			"223.6",
			"318.7",
			"358.1",
			"379.5",
			"412.3",
			"417.5",
			"425.6",
			"435.6",
			"437.7",
			"499.8",
			"547.1",
			"595.7",
			"624.8",
			"661.1",
			"702.4",
			"733.4",
			"758.5",
			"802.3",
			"840.5",
			"859.2",
			"860.9",
			"919.2",
			"941.3",
			"944.6",
			"948.6",
			"963.3",
			"967.9",
			"977.3",
			"992.6",
			"1006.5",
			"1022.0",
			"1033.0",
			"1061.6",
			"1068.3",
			"1074.5",
			"1091.0",
			"1095.9",
			"1146.7",
			"1178.3",
			"1192.5",
			"1203.7",
			"1256.5",
			"1316.4",
			"1344.8",
			"1384.7",
			"1401.1",
			"1420.8",
			"1427.9",
			"1453.7",
			"1508.2",
			"1530.8",
			"1623.7",
			"1632.7",
			"1641.9",
			"1645.6",
			"1649.5",
			"1676.2",
			"1713.7",
			"1796.8",
			"1838.7",
			"1848.3",
			"1865.9",
			"1889.7",
			"1896.3",
			"1979.9",
			"2003.5",
			"2006.3",
			"2009.1",
			"2016.5",
			"2029.1",
			"2038.6"
		],
		"실체": [
			"1301.3"
		],
		"가정": [
			"136.8",
			"937.1",
			"1576.9"
		],
		"질서": [
			"609.6"
		],
		"고양이의": [
			"1333.3",
			"1628.1"
		],
		"수록": [
			"1396.3"
		],
		"요리사": [
			"126.9"
		],
		"구조": [
			"300.8",
			"491.9",
			"523.8"
		],
		"위": [
			"212.7"
		],
		"데": [
			"1140.3"
		],
		"배우": [
			"1202.2"
		],
		"사용": [
			"588.6",
			"601.4",
			"1829.2",
			"1842.4",
			"1875.8",
			"1952.0",
			"1972.0",
			"1995.7",
			"1996.8",
			"1999.3"
		],
		"고의": [
			"230.0"
		],
		"술": [
			"1295.1"
		],
		"문장": [
			"289.7"
		],
		"지진": [
			"329.2"
		],
		"영어": [
			"601.0",
			"1290.8",
			"1435.3"
		],
		"오해": [
			"596.2"
		],
		"서핑": [
			"552.4"
		],
		"뒤란": [
			"1449.4"
		],
		"학술단체": [
			"230.6"
		],
		"차": [
			"1556.3"
		],
		"팀": [
			"402.6"
		],
		"수행": [
			"356.5",
			"375.2"
		],
		"무결": [
			"1926.1"
		],
		"사고": [
			"13.5",
			"88.4",
			"185.9",
			"237.1",
			"349.5",
			"359.8",
			"646.2",
			"657.0",
			"855.6",
			"1426.6",
			"1513.2",
			"1528.4",
			"2033.1"
		],
		"때": [
			"61.7",
			"69.6",
			"151.9",
			"996.7"
		],
		"대충": [
			"825.6"
		],
		"동일": [
			"595.5"
		],
		"성능": [
			"1989.2"
		],
		"정리": [
			"83.6",
			"189.0",
			"285.7",
			"663.2",
			"778.1"
		],
		"고요": [
			"1280.4"
		],
		"홈페이지": [
			"342.4"
		],
		"낼": [
			"892.2",
			"1420.0"
		],
		"앞": [
			"1065.1"
		],
		"이번": [
			"2.1",
			"52.0"
		],
		"일종": [
			"1115.9"
		],
		"유적": [
			"207.3"
		],
		"마디": [
			"1441.1"
		],
		"다섯": [
			"47.5",
			"658.5",
			"722.7",
			"737.7",
			"781.7"
		],
		"계산": [
			"829.4",
			"832.9",
			"858.2",
			"904.5"
		],
		"유행": [
			"1819.2"
		],
		"백과사전": [
			"199.6"
		],
		"소양인": [
			"1151.2",
			"1157.2",
			"1163.2"
		],
		"드릴": [
			"922.5"
		],
		"사고과정": [
			"410.2",
			"419.7"
		],
		"자동화": [
			"309.1",
			"623.4"
		],
		"간": [
			"132.4",
			"1262.0"
		],
		"만약": [
			"129.4",
			"1407.2",
			"1543.3"
		],
		"수학": [
			"1111.7"
		],
		"컴퓨팅": [
			"11.3",
			"86.3",
			"185.0",
			"232.3",
			"347.6",
			"644.7",
			"655.6",
			"853.2",
			"1510.6",
			"2029.5"
		],
		"교리": [
			"1421.3"
		],
		"순차": [
			"712.9",
			"1692.8",
			"1829.4"
		],
		"솔로": [
			"442.8"
		],
		"기초": [
			"1939.5"
		],
		"깔": [
			"1619.1"
		],
		"초상화의": [
			"1534.0"
		],
		"구현": [
			"265.1"
		],
		"코딩": [
			"75.0",
			"158.3",
			"166.2",
			"177.6",
			"398.6",
			"399.0",
			"1673.2",
			"1910.5",
			"2023.7"
		],
		"꾸리": [
			"1619.7"
		],
		"즙": [
			"664.2"
		],
		"기": [
			"510.9"
		],
		"탑": [
			"737.3"
		],
		"기호": [
			"1838.2",
			"1841.9",
			"1870.1"
		],
		"때문": [
			"400.0",
			"597.2",
			"883.2",
			"893.0",
			"950.8",
			"1107.3",
			"1160.2",
			"1193.6",
			"1738.5",
			"1914.5",
			"1922.1"
		],
		"일": [
			"90.9",
			"97.4",
			"155.5",
			"169.4",
			"474.5",
			"569.1",
			"577.8",
			"1000.7",
			"1001.6",
			"1889.4",
			"1895.0",
			"2035.2"
		],
		"누가": [
			"1845.9"
		],
		"캠프": [
			"1347.7"
		],
		"비교": [
			"747.0",
			"2072.0"
		],
		"사실": [
			"1485.8",
			"1577.7",
			"1787.8"
		],
		"대학교": [
			"210.2"
		],
		"초상화": [
			"1432.4",
			"1433.1"
		],
		"공통점": [
			"16.3",
			"22.0",
			"1124.5",
			"1130.1"
		],
		"스탬프": [
			"1343.0",
			"1395.0"
		],
		"강의": [
			"8.2",
			"82.8"
		],
		"체스": [
			"386.8",
			"425.9"
		],
		"단계": [
			"715.3",
			"877.2",
			"1912.9",
			"1982.6"
		],
		"등이": [
			"501.6"
		],
		"커피": [
			"1724.6"
		],
		"문제의": [
			"1471.3"
		],
		"참고": [
			"224.5"
		],
		"유용": [
			"1185.4"
		],
		"볼": [
			"1017.3",
			"1136.8",
			"1336.9",
			"1718.7"
		],
		"정확": [
			"91.3",
			"1800.0",
			"2035.5"
		],
		"점": [
			"462.1"
		],
		"하나하나": [
			"783.0",
			"824.8",
			"1042.8"
		],
		"일정": [
			"1716.1"
		],
		"기존의": [
			"688.2"
		],
		"수가": [
			"819.8",
			"892.4",
			"923.2",
			"1054.2",
			"1337.9",
			"1510.1"
		],
		"꽁치": [
			"1568.8"
		],
		"마지막": [
			"719.6",
			"1884.0"
		],
		"개발": [
			"463.8"
		],
		"퇴원": [
			"1760.5"
		],
		"비용": [
			"799.4"
		],
		"날": [
			"794.1"
		],
		"눈의": [
			"1223.0",
			"1228.8"
		],
		"주요": [
			"2046.7"
		],
		"여호와": [
			"428.2"
		],
		"철": [
			"1265.1"
		],
		"오류": [
			"1903.2",
			"1920.3"
		],
		"사상체질": [
			"1143.7"
		],
		"수요": [
			"1112.3"
		],
		"무엇": [
			"6.7",
			"33.5",
			"1283.3",
			"1505.6",
			"1816.7",
			"2069.5"
		],
		"검토": [
			"2006.6"
		],
		"카네기멜론대": [
			"330.9"
		],
		"시스템": [
			"912.6"
		],
		"동작": [
			"913.6"
		],
		"누구": [
			"1862.5"
		],
		"추상화": [
			"29.0",
			"301.7",
			"526.2",
			"691.9",
			"1464.6",
			"2050.6"
		],
		"세": [
			"741.1"
		],
		"인터넷": [
			"194.3",
			"460.8",
			"550.4"
		],
		"칸": [
			"1715.8"
		],
		"연구": [
			"1932.2"
		],
		"시험": [
			"263.7"
		],
		"도록": [
			"19.1"
		],
		"강식": [
			"308.1"
		],
		"분할": [
			"27.4",
			"565.8",
			"668.8",
			"681.8",
			"797.1",
			"886.6",
			"887.2",
			"956.2",
			"985.7",
			"1009.6",
			"1083.9",
			"1209.2",
			"2049.0"
		],
		"각의": [
			"2064.8"
		],
		"녹색눈의": [
			"1547.2"
		],
		"녹색": [
			"1221.4"
		],
		"명령": [
			"1696.8",
			"1736.8",
			"1824.7"
		],
		"공통": [
			"1247.3"
		],
		"작업": [
			"996.1",
			"999.6",
			"1184.5",
			"1191.3",
			"1195.3",
			"1206.8",
			"1215.7",
			"1245.2",
			"1260.5",
			"1314.6",
			"1325.9",
			"1379.3",
			"1459.2",
			"1495.4",
			"1505.1",
			"1522.6",
			"1527.2",
			"1647.9",
			"1668.8",
			"1795.3",
			"1809.2"
		],
		"색연필": [
			"1357.1"
		],
		"안": [
			"609.0"
		],
		"활용": [
			"1005.3",
			"1416.9",
			"1427.1",
			"1522.0"
		],
		"컬러": [
			"1271.1"
		],
		"무대": [
			"1022.6",
			"1037.2"
		],
		"사고력": [
			"506.7"
		],
		"대상": [
			"1024.6"
		],
		"실행": [
			"258.2",
			"1694.7"
		],
		"모델": [
			"1651.6"
		],
		"그림": [
			"390.2",
			"554.0"
		],
		"내용": [
			"539.7",
			"778.6",
			"1057.2"
		],
		"교수님의": [
			"448.1"
		],
		"중": [
			"740.7",
			"1212.0",
			"1906.3"
		],
		"외과": [
			"1782.9"
		],
		"란": [
			"6.5"
		],
		"고등어": [
			"1557.1"
		],
		"숫자의": [
			"1128.1"
		],
		"전화": [
			"1496.0"
		],
		"방식": [
			"263.2",
			"478.7"
		],
		"좌우": [
			"1800.9"
		],
		"다양": [
			"1582.2"
		],
		"핵심원리": [
			"473.2"
		],
		"컴퓨팅사고": [
			"4.5",
			"23.3",
			"73.8",
			"119.9",
			"174.5",
			"332.3",
			"590.0",
			"1057.7",
			"1186.0",
			"1681.8",
			"1851.9",
			"2041.8",
			"2086.4"
		],
		"비디오": [
			"1826.1"
		],
		"과정": [
			"140.5",
			"239.8",
			"272.7",
			"281.2",
			"284.6",
			"360.6",
			"381.3",
			"504.6",
			"735.7",
			"1196.0",
			"1443.9",
			"1462.4",
			"1467.9",
			"1590.2",
			"1652.9",
			"1657.3",
			"1854.2",
			"1898.1",
			"1916.0",
			"2009.4"
		],
		"다이어그램": [
			"1831.5"
		],
		"조작": [
			"485.8",
			"519.8"
		],
		"말": [
			"470.4",
			"518.1",
			"536.4",
			"1646.8",
			"1755.5",
			"1764.5"
		],
		"영국": [
			"640.1",
			"643.0"
		],
		"내": [
			"435.3",
			"1560.6",
			"1571.4"
		],
		"순서": [
			"155.8",
			"494.0",
			"532.4",
			"619.3",
			"1724.0",
			"1727.7"
		],
		"학문분야": [
			"1933.5"
		],
		"이야기": [
			"445.8",
			"625.3",
			"642.3",
			"774.5",
			"1404.8",
			"1589.3",
			"1658.0",
			"1699.8",
			"1817.7",
			"2038.9",
			"2077.2"
		],
		"분석": [
			"607.7",
			"1963.7"
		],
		"설정": [
			"1834.5"
		],
		"표준": [
			"1837.4",
			"1841.3",
			"1867.9"
		],
		"시": [
			"1870.7"
		],
		"시작": [
			"936.4"
		],
		"우리": [
			"811.9",
			"820.4",
			"1010.0",
			"1107.9",
			"1250.5",
			"1340.9",
			"1408.7",
			"1475.0",
			"1650.0",
			"1663.6",
			"1705.1"
		],
		"안녕": [
			"0.0"
		],
		"분양": [
			"229.1"
		],
		"차이": [
			"178.5"
		],
		"고환": [
			"43.9"
		],
		"측면": [
			"1985.7"
		],
		"순서도": [
			"475.8"
		],
		"아웃": [
			"1450.7",
			"1615.0"
		],
		"표현법": [
			"430.4"
		],
		"지": [
			"1991.3"
		],
		"오른쪽": [
			"222.5",
			"553.1",
			"803.8"
		],
		"단지": [
			"1626.8"
		],
		"사고방식": [
			"469.7"
		],
		"패턴의": [
			"1115.1",
			"1445.7",
			"1630.9"
		],
		"저희": [
			"15.0"
		],
		"수도": [
			"596.7",
			"1383.2",
			"1921.4",
			"1987.3"
		],
		"연결": [
			"1013.3"
		],
		"예": [
			"106.5",
			"140.9",
			"927.7",
			"963.7",
			"1116.6",
			"1143.3",
			"1147.1",
			"1218.2",
			"1316.6",
			"1538.9",
			"1542.7",
			"1786.2",
			"1988.3"
		],
		"저": [
			"573.5"
		],
		"의": [
			"653.3",
			"810.9",
			"813.9",
			"841.4",
			"857.2",
			"897.3",
			"1301.0"
		],
		"인간": [
			"77.1"
		],
		"눈": [
			"1253.0",
			"1262.2",
			"1268.4",
			"1350.1",
			"1566.1",
			"1600.2",
			"1628.7"
		],
		"모니터": [
			"1232.5",
			"1567.7"
		],
		"고양이": [
			"1213.5",
			"1220.4",
			"1225.6",
			"1236.1",
			"1246.6",
			"1259.3",
			"1273.3",
			"1280.7",
			"1307.9",
			"1312.8",
			"1324.7",
			"1541.9",
			"1545.5",
			"1561.0",
			"1571.9",
			"1597.1",
			"1644.4",
			"1647.1"
		],
		"수행의": [
			"713.9"
		],
		"앱": [
			"1435.7"
		],
		"그릇": [
			"142.3"
		],
		"하나": [
			"629.7",
			"752.6",
			"754.0",
			"758.8",
			"877.6",
			"1361.1",
			"1539.2"
		],
		"편리": [
			"69.2",
			"1999.1"
		],
		"발생": [
			"933.3",
			"940.7",
			"967.5",
			"970.0"
		],
		"줄": [
			"1567.1"
		]
	}
}